collections - це стандартний модуль Python, який забезпечує кілька спеціалізованих структур даних такі як:

OrderedDict - словник, який зберігає елементи в порядку їх додавання. 
Він містить ті ж функції, що і звичайний словник, але додатково має метод move_to_end(),
який дозволяє перемістити елемент на кінець.

defaultdict - словник, який містить значення за замовчуванням для нового елементу. 
Це дозволяє зберігати дані без перевірки чи існує ключ в словнику перед додаванням значення.

ChainMap - клас, який дозволяє зєднати кілька словників або мапінги у одну структуру даних.
Він дозволяє запитувати дані з кількох словників одночасно та переважає дані з першого словнику над даними з наступного.